# Data Types

생성일: 2022년 12월 3일 오후 8:04

# Redis 데이터 유형 튜토리얼

## Key

- 모든 바이너리 시퀀스를 키로 사용 가능
  - 예를 들어 빈 문자열도 가능하다.

### 규칙

- 매우 긴 Key는 좋지 않다.
  - 키 비교에 불리하다.
  - 차라리 hash를 사용하는 것이 메모리와 대역폭의 관점에서 더 낫다.
- 너무 짧은 Key는 좋지 않다.
  - 짧으면 메모리를 덜 먹긴 하지만, 가독성을 해친다.
- 스키마를 고수할 것
  - 점과 dash를 사용해서 키를 작성하는 것이 좋음
- 가능한 최대 키 크기는 512MB이다.

---

## String

- HTML조각이나 페이지 캐싱같은 곳에 유용하게 사용됨.
- Set명령어와 Get명령어로 문자열 타입을 처리할 수 있다.
  - `set mykey somevalue (option)` 와 같이 저장가능.
  - `get mykey`로 호출가능
- 최대 가능한 데이터 크기는 512MB
- Set
  ```bash
  > set mykey newval nx
  (nil)
  > set mykey newval xx
  OK
  ```
  - (default)이미 값이 있는 경우 또 set을 하면 덮어씌워짐
  - (option1)nx를 옵션으로 넣는 경우, 이미 값이 없는 Key에만 set성공
    - 또는 SETNX명령어 사용 가능
  - (option2)nn을 옵션으로 넣는 경우, 이미 값이 있는 Key에만 set성공
- 문자열이 숫자로 되어있을 경우에 숫자 증가를 시킬 수 있음
  ```bash
  > set counter 100
  OK
  > incr counter
  (integer) 101
  > incr counter
  (integer) 102
  > incrby counter 50
  (integer) 152
  ```
  - incr: 문자열을 정수로 분석하고, 하나씩 증가시킨다.
  - incrby: 문자열을 정수로 분석하고, n만큼 증가시킨다.
  - incrbyfloat: 문자열을 실수로 분석하고, n만큼 증가
  - 같은 맥락으로 decr와 decrby는 위와 반대로 감소시킨다.
  - atomic하게 실행된다. 수많은 클라이언트에 동시에 실행해도 결과는 조회-증가-저장이 수행된다.
- multi set/get
  ```bash
  > mset a 10 b 20 c 30
  OK
  > mget a b c
  1) "10"
  2) "20"
  3) "30"
  ```
- 대부분의 문자열 작업은 O(1)
- substr, getrange, setrange는 O(N)일 수 있음.

## 키 공간 변경 및 쿼리하기

```bash
> set mykey hello
OK
> exists mykey
(integer) 1
> del mykey
(integer) 1
> exists mykey
(integer) 0
> set mykey x
OK
> type mykey
string
> del mykey
(integer) 1
> type mykey
none
```

- exists 명령어: 데이터베이스에 해당 키가 있는지 0 or 1로 응답
- del 명령어: 키와 관련된 값을 삭제
  - 성공시 1 반환
  - 해당 키가 없을 시 0 반환
- type 명령어: 해당 값의 타입을 반환

## Key Expire

- “time to live” 또는 “TTL”이라고 불리운다.
- 설정 시간이 지나면 해당 키가 삭제된다.
- 초 또는 밀리초를 이용해 설정 가능하다
- 만료시간 단위는 항상 1밀리초이다.
- 만료에 대한 정보는 복제되고 디스크에 유지되며, Redis서버가 정지된 시간이 사실상 지나간다. (Redis가 키가 만료되는 날짜를 저장한다.)
- 밀리초 단위로 만료를 설정하려면 pexpir 명령어와 pttl을 알아야한다.
- Use Case
  ```bash
  > set key some-value
  OK
  > expire key 5
  (integer) 1
  > get key (immediately)
  "some-value"
  > get key (after some time)
  (nil)
  # JSON 객체 삽입
  > SET ticket:27 "\"{'username': 'priya', 'ticket_id': 321}\"" EX 100
  ```
  - 두번째 get이 5초 이상 지연되어서 키가 사라졌다.
  - 만료를 제거하기 위해서 persist 명령어를 사용할 수 있다.
  - set을 이용해서 만료를 설정할 수 있다.
  ```bash
  > set key 100 ex 10
  OK
  > ttl key
  (integer) 9
  ```
  - 100이라는 키를 10초 이후에 만료한다.
  - ttl명령어를 사용해 키의 남은 초를 알 수 있다.

---

## Lists

- Redis에서의 list구현은 linked list형식으로 구현되어있다.
  - 장점: list의 head나 tail에 요소를 추가하는 작업이 일정한 시간에 수행된다.
  - 단점: index로 node에 액세스하는 것은 일반 배열보다 빠르지 않은 편이다.
- 만약 대규모 컬렉션의 중간 node에 빠르게 접근하는 것이 중요할 때, sorted sets를 사용할 수 있다.
- 최대 길이는 2^32 - 1 (4,294,967,295)이다

### First steps with Redis Lists

- lpush: list의 왼쪽(head)에 새 요소를 추가
- rpush: list의 오른쪽(tail)에 새 요소를 추가
- lrange: list에서 요소 범위를 추출한다. 두가지 범위를 설정할 수 있고, 음수를 가질 수 있다. 0은 맨 처음, -1은 맨 마지막 요소를 뜻한다.
- Use Case
  ```bash
  > rpush mylist A
  (integer) 1
  > rpush mylist B
  (integer) 2
  > lpush mylist first
  (integer) 3
  > lrange mylist 0 -1
  1) "first"
  2) "A"
  3) "B"
  > rpush mylist 1 2 3 4 5 "foo bar"
  (integer) 9
  ```
- rpop: 제일 오른쪽 요소를 pop한다.
- Use Case
  ```bash
  > rpush mylist a b c
  (integer) 3
  > rpop mylist
  "c"
  > rpop mylist
  "b"
  > rpop mylist
  "a"
  > rpop mylist
  (nil)
  ```

### lists의 일반적인 Use Case

- 사용자가 소셜 네트워크에 게시한 최신 업데이트를 기억하세요
- 생산자가 항목을 목록으로 푸시하고, consumer-producer 패턴을 사용하는 프로세스간의 통신. Redis에는 이 사례를 안정적이고 효율적으로 만들기 위한 명령이 있다.

### Capped lists

- cap된 컬렉션으로 사용할 수 있다. 최신 n개 항목만 기억하고, ltrim명령을 사용해 가장 오래된 모든 항목을 제거할 수 있다.
- ltrim 명령어는 lrange와 비슷해보이지만, 지정된 요소 범위를 표시하는 대신 이 범위를 새로운 list값으로 설정한다. 저장된 범위를 벗어난 모든 요소가 제거된다.
- Use Case
  ```bash
  > rpush mylist 1 2 3 4 5
  (integer) 5
  > ltrim mylist 0 2
  OK
  > lrange mylist 0 -1
  1) "1"
  2) "2"
  3
  ```
- lrange 명령어는 기술적으로 O(N)의 복잡도를 가진다. 하지만 head 또는 tail의 작은 범위를 가져올 때는 일정한 작업시간을 소요한다.

### Blocking operations on lists (작업 차단)

- list는 queue를 구현하는데 적합한 특수 기능이 있고, 일반적으로 프로세스간 통신 시스템에서 사용된다.
- 하나의 프로세스 항목을 list로 push하고, 실제로 다른 곳에서 해당 항목을 사용한다면 일반적인 생산자/소비자 패턴이다.
  - 아이템을 list에 올리기 위해 producer는 lpush를 명령한다.
  - list에서 아이템을 추출/처리하기 위해 consumer는 rpop 명령어를 사용한다.
- 때때로 list가 비어있을 때는 rpop이 null을 반환한다. 이 경우에는 consumer는 일정 시간 이후 재시도 해야한다.(폴링) 하지만 이 방법은 단점이 있으므로 좋은 방법은 아니다.
  - redis와 클라이언트가 불필요한 명령을 처리하도록 한다.
  - worker가 null을 받은 후 시간이 얼마동안 기다리기 때문에 아이템 처리에 지연시간을 추가한다. 지연시간을 줄이기 위해 더 불필요한 명령을 사용해야 한다.
- 그래서 redis는 list가 비어있으면 차단할 수 있는 rpop과 lpop버전인 brpop과 blpop이라는 명령어를 구현한다.
- brpop, blpop: 새 아이템이 list에 추가되거나 사용자가 지정한 시간 초과에 도달했을 때만 consumer에게 호출된다.
  ```bash
  > brpop tasks 5
  1) "tasks"
  2) "do_something"
  ```
  - 이는 “list의 아이템을 기다리지만 5초 후에 사용할 수 있는 아이템이 없으면 반환”을 뜻한다.
  - 0을 타임아웃으로 사용해 요소를 영원히 기다릴 수 있다.
  - 여러 list를 대기하고 첫 list가 아이템을 받으면 알림을 받기위해 여러 list를 지정할 수 있다.
- brpop, blpop의 주의사항
  - 클라이언트는 정렬된 방식으로 제공된다.
  - 반환 값은 rpop과 다르다.
  - 타임아웃에 도달하면 null이 반환된다.
- lmove를 사용해 더 안전한 대기열을 queue를 만들거나 원형queue를 만들 수 있다.
- blmove라고 불리는 명령의 차단 변형도 있다.

### 키의 자동 생성 및 제거

- 집계 데이터 유형에 요소를 추가할 때, 대상 키가 존재하지 않으면 요소를 추가하기 전에 빈 집계 데이터 유형이 생성된다.
  ```bash
  > del mylist
  (integer) 1
  > lpush mylist 1 2 3
  (integer) 3
  > set foo bar
  OK
  > lpush foo 1 2 3
  (error) WRONGTYPE Operation against a key holding the wrong kind of value
  > type foo
  string
  ```
- 집계 데이터 유형에서 요소를 제거할 때, 값이 비어있으면 키가 자동으로 삭제된다. 스트림 데이터 유형은 이 규칙의 유일한 예외다.
  ```bash
  > lpush mylist 1 2 3
  (integer) 3
  > exists mylist
  (integer) 1
  > lpop mylist
  "3"
  > lpop mylist
  "2"
  > lpop mylist
  "1"
  > exists mylist
  (integer) 0
  ```
- llen(list의 길이를 반환)과 같은 읽기 전용 명령이나 빈 키로 요소를 제거하는 쓰기명령을 호출하면, 키가 명령이 찾으려고 하는 유형의 빈 집계 유형을 보유하고 있는 것과 동일한 결과가 항상 생성된다.
  ```bash
  > del mylist
  (integer) 0
  > llen mylist
  (integer) 0
  > lpop mylist
  (nil)
  ```
- 보통 O(1)의 시간 복잡도를 가짐
- lindex, linsert, lset은 O(N)을 가져서 대용량 데이터 처리시 주의해야 함

---

## Hashes

- 길이 제한: 4,294,967,295 (2^32 - 1)

```bash
> hset user:1000 username antirez birthyear 1977 verified 1
(integer) 3
> hget user:1000 username
"antirez"
> hget user:1000 birthyear
"1977"
> hgetall user:1000
1) "username"
2) "antirez"
3) "birthyear"
4) "1977"
5) "verified"
6) "1"
```

- hset: 해시의 여러 필드를 설정하는 명령어
- hget: 단일 필드 검색
- hmget: hget과 결과는 비슷하지만 값 배열 반환
  ```bash
  > hmget user:1000 username birthyear no-such-field
  1) "antirez"
  2) "1977"
  3) (nil)
  ```
- hincrby: 개별 필드에서 사용 가능한 명령어
  ```bash
  > hincrby user:1000 birthyear 10
  (integer) 1987
  > hincrby user:1000 birthyear 10
  (integer) 1997
  ```
- 작은 해시(작은 값을 가진 몇가지 요소)가 메모리에서 매우 효율적으로 만드는 특별한 방식으로 인코딩 된다.
- 성능
  - 대부분 O(1)
  - hkeys, hvals, hgetall 은 O(N)의 복잡도를 가짐

---

## Sets

- Sets는 정렬되지 않은 문자열 모음이다.
- 한계 길이: 2^32 - 1 (4,294,967,295)
- sadd: set에 새로운 요소를 추가한다.
  - 주어진 요소가 이미 존재하는 경우 교차, 조합, 여러 set와 비교와 같은 같은 집합에 대해 많은 다른 작업을 수행할 수 있다.

```bash
> sadd myset 1 2 3
(integer) 3
> smembers myset
1. 3
2. 1
3. 2
```

- set에 세가지 요소를 추가하고 모두 반환할 때, 정렬되지 않는다.

```bash
> sismember myset 3
(integer) 1
> sismember myset 30
(integer) 0
```

- 3은 set의 멤버이지만, 30은 아니다.
- 사용처
  - set는 객체와의 관계를 표현하는데 자주 쓰인다.
    - 예를 들어 태그를 구현하기 위해 태그하고 싶은 모든 객체에 대한 id set를 갖는 것이다.
  - 고유한 항목을 추적한다.
    - 주어진 블로그 게시물에 액세스하는 모든 고유한 IP 주소를 추적
  - intersection, unions 또는 diff작업을 수행한다.

```bash
# 한 뉴스에 여러개의 태그를 달음
> sadd news:1000:tags 1 2 5 77
(integer) 4
# 각 태그에 뉴스를 등록
> sadd tag:1:news 1000
(integer) 1
> sadd tag:2:news 1000
(integer) 1
> sadd tag:5:news 1000
(integer) 1
> sadd tag:77:news 1000
(integer) 1
# 해당 태그에 대한 정보를 받아오기
> smembers news:1000:tags
1. 5
2. 1
3. 77
4. 2
```

- sinter: 다른 set와의 교차점을 수행하는 명령어
  ```bash
  > sinter tag:1:news tag:2:news tag:10:news tag:27:news
  ... results here ...
  ```
- spop: 요소 추출. 특정 문제를 모델링하는 것에 편리함.
  - 웹 기반 포커 게임을 구현할 때, set로 덱을 대표할 수 있음
  ```bash
  > sadd deck C1 C2 C3 C4 C5 C6 C7 C8 C9 C10 CJ CQ CK
    D1 D2 D3 D4 D5 D6 D7 D8 D9 D10 DJ DQ DK H1 H2 H3
    H4 H5 H6 H7 H8 H9 H10 HJ HQ HK S1 S2 S3 S4 S5 S6
    S7 S8 S9 S10 SJ SQ SK
  (integer) 52
  ```
  - spop을 이용해 무작위로 요소를 제거해 클라이언트로 반환.
- sunionstore: 여러 set간의 조합을 수행하고 결과를 다른 세트로 저장하는 명령어
  ```bash
  > sunionstore game:1:deck deck
  (integer) 52
  > spop game:1:deck
  "C6"
  > spop game:1:deck
  "CQ"
  > spop game:1:deck
  "D1"
  > spop game:1:deck
  "CJ"
  > spop game:1:deck
  "SJ"
  ```
- scard: 세트 내부의 요소 수를 제공하는 명령어
  ```bash
  > scard game:1:deck
  (integer) 47
  # 52 - 5 = 47
  ```
- srandmember: 세트에서 제거하지 않고 랜덤 요소를 가져와야할 때 사용하는 명령어. 반복 요소와 반복되지 않는 요소를 모두 반환할 수 있는 기능이 있음.
- srem: set에서 특정 멤버 삭제
- 성능
  - 대부분의 세트작업은 O(1)
  - smembers는 O(n) 대안으로 sscan을 사용할 것을 권장
  - 메모리 사용량이 걱정되고 완벽한 정밀도가 필요하지 않다면, set의 대안으로 bloom filter 또는 cuckoo filter를 고려할 것
  - set은 일종의 인덱스로 많이 사용된다. 데이터를 인덱싱하고 쿼리해야한다면 redisearch와 redisJSON을 고려해보자

---

## Sorted sets

- 정렬된 set는 set과 hash 사이의 혼합과 유사한 데이터 유형
- set과 마찬가지로 정렬된 set는 독특하고 반복되지 않는 문자열 요소로 구성됨. 어떤 의미에서는 정렬된 set도 set이다.
- sorted set의 모든 요소는 score라고 부ㄹ리는 부동 소수점 값과 관련이 있다.
  - 모든 요소가 값에 매핑되기 때문에 type이 hash와 유사한 이유이다.
- sorted set의 요소는 순서대로 처리됨.
  - 요청에 따라 정렬되지 않고, 순서는 sorted set를 나타내는 데 사용되는 데이터 구조의 특성임
- 예
  - A와 B가 다른 score를 가진 두 요소인 경우 `A.score > B.score` 일 때, `A > B`
  - A와 B가 정확히 똑같은 점수를 가지고 있다면 문자열로 대소 비교. sorted set에는 고유한 요소만 있기 때문에 A문자열과 B문자열은 같을 수 없다.
  ```bash
  > zadd hackers 1940 "Alan Kay"
  (integer) 1
  > zadd hackers 1957 "Sophie Wilson"
  (integer) 1
  > zadd hackers 1953 "Richard Stallman"
  (integer) 1
  > zadd hackers 1949 "Anita Borg"
  (integer) 1
  > zadd hackers 1965 "Yukihiro Matsumoto"
  (integer) 1
  > zadd hackers 1914 "Hedy Lamarr"
  (integer) 1
  > zadd hackers 1916 "Claude Shannon"
  (integer) 1
  > zadd hackers 1969 "Linus Torvalds"
  (integer) 1
  > zadd hackers 1912 "Alan Turing"
  (integer) 1
  ```
  - zadd: sadd와 비슷하지만 score를 받는 추가적인 argument를 받는다.
    - 여러 score-value 쌍을 자유롭게 지정할 수 있다.
  - sorted set을 사용하면 이미 정렬되었기 때문에 출생 연도별로 해커목록을 반환하는 것은 쉬운 일이다.
  - sorted set는 skip table과 hash table을 모두 포함하는 dual-ported 구조를 통해 구현됨
    - 요소를 추가할 때마다 O(log(N)) 가 소요됨.
    - 우리가 정렬된 요소를 조회할 때는 이미 정렬되어있음.
  ```bash
  > zrange hackers 0 -1
  > zrevrange hackers 0 -1
  > zrange hackers 0 -1 withscores
  ```
  - zrange: 범위 호출, 0은 맨처음. -1은 제일 마지막
  - zrevrange: 가장 뒤에서부터 호출
  - withscores: score와 함께 조회
- 성능
  - 대부분 O(log(n)) - n은 멤버수
  - zrange 사용시 수만개 이상으로 반환할 때 조심해야함. O(log(n) + m) 여기서 m은 반환된 결과의 수

### Operating on ranges (범위 실행)

- zrangebyscore: 범위를 통해 score를 기준으로 조회하는 명령어
  ```bash
  > zrangebyscore hackers -inf 1950
  1) "Alan Turing"
  2) "Hedy Lamarr"
  3) "Claude Shannon"
  4) "Alan Kay"
  5) "Anita Borg"
  ```
  - 음의 무한대와 1950사이의 score를 호출함
- zremrangebyscore: score기준 범위 삭제
  ```bash
  > zremrangebyscore hackers 1940 1960
  (integer) 4
  ```
  - 제거된 요소 수 반환
- zrank: 정렬된 요소 세트에서 요소의 위치가 무엇인지 알 수 있는 명령어
  ```bash
  > zrank hackers "Anita Borg"
  (integer) 4
  ```
  - zrevrank: 내림차순으로 위치 파악

### Lexicographical scores(사전적 점수)

- set의 모든 요소가 동일한 score로 삽입된다고 가정하고 사전적으로 범위를 얻을 수 있는 기능(이름 오름차/내림차순)
- zrangebylex, zrevrangebylex, zremrangebylex, zlexcount가 해당
- 예
  ```bash
  # 같은 점수로 삽입
  > zadd hackers 0 "Alan Kay" 0 "Sophie Wilson" 0 "Richard Stallman" 0
    "Anita Borg" 0 "Yukihiro Matsumoto" 0 "Hedy Lamarr" 0 "Claude Shannon"
    0 "Linus Torvalds" 0 "Alan Turing"
  # 이미 이름순으로 정렬됨
  > zrange hackers 0 -1
  1) "Alan Kay"
  2) "Alan Turing"
  3) "Anita Borg"
  4) "Claude Shannon"
  5) "Hedy Lamarr"
  6) "Linus Torvalds"
  7) "Richard Stallman"
  8) "Sophie Wilson"
  9) "Yukihiro Matsumoto"
  # 사전 기준으로 호출 가능
  > zrangebylex hackers [B [P
  1) "Claude Shannon"
  2) "Hedy Lamarr"
  3) "Linus Torvalds"
  ```
  - 범위는 포괄적이거나 배타적일 수 있음(첫 문자에 따라 달라짐)
  - +: 무한 문자열
  - -: 마이너스 무한 문자열
- 정렬된 세트를 일반 인덱스로 사용할 수 있어 중요함.

### Updating the score: leader boards

- sorted set의 score는 언제든지 변경 가능
- sorted set에 이미 포함된 요소에 대해 zadd명령어를 사용해 점수가 O(log(N))의 시간 복잡도로 변경됨
- sorted set은 수많은 업데이트가 있을 때 적합
- 일반적인 사용 예:
  - 리더보드(대규모 온라인 게임에서 가장 높은 점수의 정렬된 목록을 쉽게 유지가능)
  - 요금제한자(과도한 API요청을 방지하기 위해 슬라이딩 윈도우 속도 제한기를 구현 가능)

---

## Streams

- 추가 전용 로그처럼 작동하는 데이터 구조
- 실시간으로 이벤트를 기록하고 동시에 syndicate 가능함
- Use Case
  - 이벤트 소싱 (사용자 행동추적, 클릭)
  - 센서 모니터링 (현장의 장치에서 읽어들임)
  - 알림 (각 사용자의 알림 기록을 별도의 스트림에 저장)
- redis는 각 스트림 항목에 대해 고유한 ID 생성
  - 이 ID를 사용해 관련 항목을 검색하거나 스트림의 모든 후속 항목을 읽고 처리가능
- stream은 여러 trimming 전략과 하나 이상의 소비전략을 지원
  - trimming 전략: 스트림이 제한없이 증가하는 것을 방지하기 위해
  - 소비 전략: xread, xreadgroup, xrange
- 각 스트림 항목은 record나 hash와 비슷한 하나이상의 field-value쌍으로 구성된다.
- 예
  ```bash
  # 몇개의 온도계 정보 저장
  # temperatures:us-ny:10007: 키에 해당하는 스트림
  # *: 자동으로 increase되는 ID를 사용
  # 이후 stream 구성하는 필드 - 값 쌍
  > XADD temperatures:us-ny:10007 * temp_f 87.2 pressure 29.69 humidity 46
  "1658354918398-0"
  > XADD temperatures:us-ny:10007 * temp_f 83.1 pressure 29.21 humidity 46.5
  "1658354934941-0"
  > XADD temperatures:us-ny:10007 * temp_f 81.9 pressure 28.37 humidity 43.7
  "1658354957524-0"

  # 특정 기기에서 처음 시작하는 두개의 스트림 항목을 읽어오기
  > XRANGE temperatures:us-ny:10007 1658354934941-0 + COUNT 2
  1) 1) "1658354934941-0"
     2) 1) "temp_f"
        2) "83.1"
        3) "pressure"
        4) "29.21"
        5) "humidity"
        6) "46.5"
  2) 1) "1658354957524-0"
     2) 1) "temp_f"
        2) "81.9"
        3) "pressure"
        4) "28.37"
        5) "humidity"
        6) "43.7"
  # stream 끝에서 시작해 최대 100개의 새로운 스트림 항목을 읽고 항목이 작성되지 않으면 최대 300ms를 차단
  > XREAD COUNT 100 BLOCK 300 STREAMS temperatures:us-ny:10007 $
  (nil)
  ```

### Getting data from Streams

- 여러 클라이언트에서 메시지를 보낼 수 있도록 해야함
- 시간 범위 별로 메시지를 가져오거나 커서를 사용해 메시지를 반복해 모든 기록을 점진적으로 확인 해야함.
- 단일 소비자가 모든 메시지를 처리하지 않고도 다른 소비자 간에 메시지 처리를 확장할 수 있다. (카프카가 consumer group과 하는일)
- 예
  ```bash
  # 범위를 이용한 stream 조회
  # - + 은 최소, 최대 범위를 조회하는 것
  > XRANGE mystream - +
  1) 1) 1518951480106-0
     2) 1) "sensor-id"
        2) "1234"
        3) "temperature"
        4) "19.8"
  2) 1) 1518951482479-0
     2) 1) "sensor-id"
        2) "9999"
        3) "temperature"
        4) "18.2"
  # 2 밀리초 사이를 조회
  > XRANGE mystream 1518951480106 1518951480107
  1) 1) 1518951480106-0
     2) 1) "sensor-id"
        2) "1234"
        3) "temperature"
        4) "19.8"
  # 전체에서 상위 2개만 조회
  > XRANGE mystream - + COUNT 2
  1) 1) 1519073278252-0
     2) 1) "foo"
        2) "value_1"
  2) 1) 1519073279157-0
     2) 1) "foo"
        2) "value_2"
  # (를 붙임으로써 다음 2개 항목을 반복 조회
  > XRANGE mystream (1519073279157-0 + COUNT 2
  1) 1) 1519073280281-0
     2) 1) "foo"
        2) "value_3"
  2) 1) 1519073281432-0
     2) 1) "foo"
        2) "value_4"
  ```

### Listening for new items with XREAD

- 보통 스트림에 도착하는 새로운 항목을 구독하는 것을 목적으로 함.
- pub/sub패턴이나 blocking list와 비슷해보이지만 근본적으로 차이가 있음.
  - stream은 여러 클라이언트(consumer)가 데이터를 기다림
  - stream은 pub/sub과 달리 무기한 추가/저장된다.
  - pub/sub또는 blocking list가 가지지 않은 수준의 제어 수준을 제공한다.

```bash
> XREAD COUNT 2 STREAMS mystream 0
1) 1) "mystream"
   2) 1) 1) 1519073278252-0
         2) 1) "foo"
            2) "value_1"
      2) 1) 1519073279157-0
         2) 1) "foo"
            2) "value_2"
```

- 이는 xread의 non-blocking 형태
- STREAMS 옵션은 항상 마지막이 되어야함.
  - 다른 스트림에서 동시에 읽기 위해 하나 이상의 키로 명령을 호출할 수 있기 때문
- 이 정도 수준은 xrange와 비슷하다. 하지만 block을 추가해 xread를 blocking 명령으로 변경할 수 있다.
  ```bash
  > XREAD BLOCK 0 STREAMS mystream $
  ```
  - 0밀리초의 타임아웃으로 BLOCK 옵션을 지정함
    - 타임아웃을 하지 않겠다는 의미
  - mystream의 특수 ID대신 “$”을 전달함.
    - xread가 이미 저장된 최대 ID를 사용해야하므로 명령한 시점으로부터 새 메시지를 수신 받겠다는 의미
    - 특정 ID부터 시작하고 싶으면 $대신 ID를 작성해도 무방함
- 데이터 조회를 FIFO스타일로 진행하기 때문에, 데이터를 읽고있는 클라이언트 관점에서도 공정하다.

### Consumer groups

- 동일한 스트림에서 많은 클라이언트에게 메시지의 다른 하위 집합을 제공하고 싶을 수 있다.
- 유용한 사례는 **처리가 느린 메시지**이다.
  - 스트림의 다른 부분을 수신할 N개의 다른 작업자가 가질 수 있는 능력은 더 많은 작업을 수행할 준비가 된 다른 작업자에게 다른 메시지를 라우팅하여 메시지 처리를 확장할 수 있다.
- 소비자 그룹은 스트림에서 데이터를 가져오는 가짜 소비자이고, 실제로 여러 소비자에게 서비스를 제공해 특정 보증을 제공한다.
  - 동일한 메시지가 여러 소비자에게 전달될 수 없다.
  - 소비자는 소비자 그룹 내에서 소비자를 이름으로 식별한다.
    - 연결이 끊어진 후에도 스트림 소비자 그룹이 모든 상태를 유지한다는 의미이다.
    - 고유식별자를 제공하는 것이 고객에게 달려있다.
  - 각 소비자 그룹은 소비되지 않은 첫 ID를 가지고 있으므로, 소비자가 새 매시지를 요청할 때 이전에 전달되지 않은 메시지만 제공 가능
  - 메시지를 사용하려면 특정 명령을 이용해 명시적인 승인이 필요
    - ”이 메시지는 소비자 그룹에서 쫓겨날 수 있도록 올바르게 처리되었습니다“로 승인을 해석함
  - 소비자 그룹은 현재 보류중인 모든 메시지를 추적한다.
    - 이 기능 덕분에 스트림의 메시지 기록에 액세스할 때, 각 소비자는 스트림에 전달된 메시지만 조회 가능하다.

```bash
+----------------------------------------+
| consumer_group_name: mygroup           |
| consumer_group_stream: somekey         |
| last_delivered_id: 1292309234234-92    |
|                                        |
| consumers:                             |
|    "consumer-1" with pending messages  |
|       1292309234234-4                  |
|       1292309234232-8                  |
|    "consumer-42" with pending messages |
|       ... (and so forth)               |
+----------------------------------------+
```

- 위와 같은 정보를 통해 다양한 정보를 알 수 있다.
- 단일 스트림은 다른 소비자 집합을 가진 여러 소비자 그룹을 가질 수 있다.
- xread를 통해 소비자 그룹 없이 읽고, xreadgroup을 통해 고객이 소비자 그룹에서 읽게 할 수 있다.

### Creating a consumer group

```bash
# mystream에 대한 소비자그룹 만들기
> XGROUP CREATE mystream mygroup $
OK
```

### Commands

- xadd: stream에 새 항목 추가
  - 새항목 추가시 \* 로 ID를 추가하면 `<millisecondsTime>-<sequenceNumber>`로 구성됨
    - sequenceNumber가 증가하는 경우는 redis node시간이 뒤돌아가거나 겹친경우.
    - 이를 통해 시간 범위로 쿼리가 가능하다.
  - 명시적으로 특수한 경우에 ID를 따로 설정 가능하다.
    - 0-1이 최소이고 0-2 또는 1-1으로 증가해야한다.
    - 0-\*로 설정해서 자동으로 sequenceNumber를 증가시키도록 할 수 있다.
- xread: 지정된 위치에서 시작해 단수 혹은 복수의 항목를 읽는다.
- xrange: 지정된 두 ID사이의 다양한 항목을 반환한다.
- xlen: stream의 길이 반환
- xgroup: 소비자 그룹을 만들고, 삭제하고, 관리하는데 사용
- xreadgroup: 소비자 그룹을 통해 스트림에서 읽는 데 사용
- xack: 소비자가 보류 중인 메시지를 올바르게 처리된 것으로 표시할 수 있는 명령이다.

### Performance

- 스트림에 항목을 추가: O(1)
- 단일 항목에 접근: O(n) - 시간 지정으로 더 소요시간을 줄일 수 있음
- xrange: O(log(n)), O(M)은 M요소 반환
- 평균적으로 매우 효율적인 삽입과 읽기를 제공한다.

---

## Geospatial

- 좌표를 저장하고 검색 가능
- 주어진 반경이나 경계 박스 안에서 가까운 지점을 찾는데 유용함
- 예
  ```bash
  # 여러 좌표 위치 추가
  > GEOADD locations:ca -122.27652 37.805186 station:1
  (integer) 1
  > GEOADD locations:ca -122.2674626 37.8062344 station:2
  (integer) 1
  > GEOADD locations:ca -122.2469854 37.8104049 station:3
  (integer) 1

  # 반경 5km내의 위치를 찾고 거리를 반환
  > GEOSEARCH locations:ca FROMLONLAT -122.2612767 37.7936847 BYRADIUS 5 km WITHDIST
  1) 1) "station:1"
     2) "1.8523"
  2) 1) "station:2"
     2) "1.4979"
  3) 1) "station:3"
     2) "2.2441"
  ```

### Commands

- geoadd: 지리공간에 추가함. 경도는 위도 앞에 위치해야 함
- geosearch: 주어진 반경이나 경계 박스를 가진 위치를 반환한다.

---

## Bitmaps

- 비트맵은 실제 데이터 유형이 아닌 문자열 유형에 정의된 비트 지향 작업 집합임.
- 하나 이상의 문자열에 대해 비트작업 수행 가능
- 문자열은 binary safe blobs 이고, 최대 길이는 512MB(2^32)임.
- 장점: 정보를 저장할 때 극도의 공간 절약을 제공함
  - 예: 다른 사용자가 증분 사용자 ID로 표시되는 시스템에서, 512MB의 메모리를 사용하는 40억명의 사용자 단일 비트 정보를 기억할 수 있음

```bash
> setbit key 10 1
(integer) 1
> getbit key 10
(integer) 1
> getbit key 11
(integer) 0
```

- setbit
  - 첫 argument로 비트 번호를, 두번째 argument로 비트를 설정할 값을 0 또는 1로 설정가능.
  - 주소 지정된 비트가 현재 문자열 길이를 벗어나면 자동으로 문자열 확대
- getbit
  - 지정된 인덱스에서 비트의 값 반환
  - 범위를 벗어난 비트는 항상 0으로 간주
- bitop
  - 다른 문자열 간에 비트 작업 수행
  - AND, OR XOR, NOT
- bitcount
  - 1로 설정된 비트 수를 보고하여 모집단 계산 수행
  - 문자열의 전체 길이를 실행. 문자열의 바이트 범위로 작동 가능
- bitpos
  - 지정된 값이 0 또는 1인 첫 번째 비트를 찾음
  - 문자열의 전체 길이를 실행. 문자열의 바이트 범위로 작동 가능
- bitmap의 사용 사례
  - 모든 종류의 실시간 분석
  - object ID와 관련된 공간 효율적이지만 고성능 boolean 정보 저장
  - 집합의 구성원이 정수 0-N에 해당하는 경우, 효율적 집합 표현
  - 각 비트가 파일 시스템이 권한을 저장하는 방식과 유사한 특정 권한을 나타내는 객체 권한
- 성능
  - setbit, getbit: O(1)
  - bitop: O(n) (n은 비교에서 가장 긴 문자열의 길이)

---

## Bitfields

- 임의의 비트길이의 정수 값을 설정, 증가 및 조회 가능
  - unsigned 1-bit 정수 ~ signed 63-bit 정수까지 가능
- 값을 문자열을 사용하여 저장
- atomic read, write, 증가 작업을 지원하기 때문에 카운터와 유사한 수치 값을 관리하기에 좋은 선택
- 예
  ```bash
  # 새 유저에게 1000 gold 지급 (gold offset은 0)
  > BITFIELD player:1:stats SET u32 #0 1000
  1) (integer) 0
  # gold를 50증가 시키고 처치 수 1추가 (처치수 offset은 1)
  > BITFIELD player:1:stats INCRBY u32 #0 50 INCRBY u32 #1 1
  1) (integer) 1050
  2) (integer) 1
  # 아이템을 샀으므로 999gold 차감
  > BITFIELD player:1:stats INCRBY u32 #0 -999
  1) (integer) 51
  # 최종 유저 상태 확인
  > BITFIELD player:1:stats GET u32 #0 GET u32 #1
  1) (integer) 51
  2) (integer) 1
  ```

### Commands

- bitfield: 하나 이상의 값을 atomic하게 설정/조회
- bitfield_ro: bitfield의 읽기 전용
- 성능
  - bitfield: O(n), n은 접근하는 counter의 수

---

## HyperLogLogs

- 고유한 것을 계산하기 위해 사용되는 확률적 데이터 구조
- redis를 이용해 많은 양을 메모리를 사용하지 않고 처리가 가능하다.
- get을 호출하여 HLL을 직렬화하고 set을 이용해 서버로 다시 역직렬화 할 수 있음.
- 최대 12KB를 사용하며 0.81%의 표준 오류를 반환한다.
- 개념적으로 HLL API는 set를 사용해서 동일한 작업을 수행하는 것과 같다.
  - 관찰된 모든 요소를 set로 sadd하고, scard를 사용하여 세트 내부의 요소 수를 확인함
  - sadd는 기존 요소를 다시 추가하지 않기 때문에 고유함.

```bash
> pfadd hll a b c d
  (integer) 1
> pfcount hll
  (integer) 4
```

- pfadd: 새로운 요소를 볼때마다 명령어를 사용해 count에 추가
- pfcount: pfadd에 추가된 고유 요소의 현재 근사치를 검색할 때 사용
- pfmerge: 두 개 이상의 HLL를 하나로 결합
- 이 데이터 구조의 사용 사례
  - 사용자가 매일 검색 형태로 수행하는 고유한 쿼리를 계산
- 성능
  - add와 count는 일정한 시간/공간에서 수행된다
  - merge는 스케치의 수가 n일 때, O(n)

---

## Other notable features (주목할 만한 특징들)

- 대규모 컬렉션의 핵심 공간을 점진적으로 반복시킬 수 있다.
- 지연시간과 대역폭을 개선하기 위해 lua scripts server를 실행 가능
- pub-sub 서버임
